###[DataFrame 연산 - 3]
- 일대일 대응으로 인덱스가 동인한 원소들끼리 연산 수행
- 연산 수행 메서드 활용
- NaN에 대한 값 설정으로 연산 수행 가능해짐

In [21]:
# [1] 모듈 로딩
import pandas as pd 
import numpy as np # 빈 칸을 의미 하는 표현법 사용 위해서

In [22]:
# [2] 데이터 준비
data={'A':[98,78,np.nan ,52],
      'B':[90,20,40,50]}

In [23]:
# [3] Dict 데이터 ==> DataFrame 형태 저장
DF1=pd.DataFrame(data)
DF1

      A   B
0  98.0  90
1  78.0  20
2   NaN  40
3  52.0  50

In [24]:
#- [4]연산 수행
# - DataFrame + 숫자
DF1.add(5,fill_value=0)

       A   B
0  103.0  95
1   83.0  25
2    5.0  45
3   57.0  55

In [25]:
# DataFrame + DataFrame
DF1.add(DF1+10, fill_value=0)

       A    B
0  206.0  190
1  166.0   50
2    NaN   90
3  114.0  110

In [28]:
data2={'A':[98,78,np.nan ,52],
      'B':[90,20,40,50]}
DF2=pd.DataFrame(data2)
DF2

      A   B
0  98.0  90
1  78.0  20
2   NaN  40
3  52.0  50

In [30]:
DF1.add(DF2, fill_value=0)

       A    B
0  196.0  180
1  156.0   40
2    NaN   80
3  104.0  100